DemoApp/app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---

<% if @project.tasks.size > 0 %>