DemoApp/app/controllers/tasks_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "login page"], ["project_id", 1], ["created_at", "2017-07-04 12:40:40.079357"], ["updated_at", "2017-07-04 12:40:40.079357"]]
---
  def create
    @project = Project.find(params[:project_id])
    @task    = @project.tasks.create!(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 58], ["LIMIT", 1]]
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["complete", "t"], ["updated_at", "2017-07-11 20:18:04.293264"], ["id", 58]]
---
  def update
    @task = Task.find(params[:id])
    @task.update_attributes!(task_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 7], ["id", 33], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 31]]
---
  def destroy
    @project = Project.find(params[:project_id])
    @task = @project.tasks.find(params[:id])
    @task.destroy